devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        CLEAR_BIT(i2c->CR1, I2C_CR1_START);
        SET_BIT(i2c->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_address(I2C_dev_t *hdl, bool write)
{
        I2C_t *i2c = get_I2C(hdl);

        if (hdl->config->addr10bit) {
                u8_t hdr = header_addr_10bit | ((hdl->address >> 7) & 0x6);

                // send header + 2 most significant bits of 10-bit address
                i2c->DR = header_addr_10bit | ((hdl->address & 0xFE) >> 7);
                if (!wait_for_I2C_event(hdl, I2C_SR1_ADD10)) {
                        return false;
                }

                // send rest 8 bits of 10-bit address
                u8_t  addr = hdl->address & 0xFF;
                u16_t tmp  = i2c->SR1;
                (void)tmp;   i2c->DR = addr;
                if (!wait_for_I2C_event(hdl, I2C_SR1_ADDR)) {
                        return false;
                }

                clear_send_address_event(hdl);

                // send repeat start
                if (!start(hdl)) {
                        return false;
                }

                // send header
                i2c->DR = write ? hdr : hdr | 0x01;
                return wait_for_I2C_event(hdl, I2C_SR1_ADDR);

        } else {
                u16_t tmp = i2c->SR1;
                (void)tmp;  i2c->DR = write ? hdl->address & 0xFE : hdl->address | 0x01;
                return wait_for_I2C_event(hdl, I2C_SR1_ADDR);
        }
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void clear_send_address_event(I2C_dev_t *hdl)
{
        I2C_t *i2c = get_I2C(hdl);

        _sys_critical_section_begin();
        u16_t tmp;
        tmp = i2c->SR1;
        tmp = i2c->SR2;
        (void)tmp;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_subaddress(I2C_dev_t *hdl, u32_t address, I2C_sub_addr_mode_t mode)
{
        I2C_t *i2c = get_I2C(hdl);

        switch (mode) {
        case I2C_SUB_ADDR_MODE__3_BYTES:
                i2c->DR = address >> 16;
                if (!wait_for_I2C_event(hdl, I2C_SR1_BTF))
                        break;
                // if there is no error then send next bytes

        case I2C_SUB_ADDR_MODE__2_BYTES:
                i2c->DR = address >> 8;
                if (!wait_for_I2C_event(hdl, I2C_SR1_BTF))
                        break;
                // if there is no error then send next bytes

        case I2C_SUB_ADDR_MODE__1_BYTE:
                i2c->DR = address & 0xFF;
                return wait_for_I2C_event(hdl, I2C_SR1_BTF);

        default:
                errno = EINVAL;
                return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void set_ACK_according_to_reception_size(I2C_dev_t *hdl, size_t count)
{
        I2C_t *i2c = get_I2C(hdl);

        if (count == 2) {
                SET_BIT(i2c->CR1, I2C_CR1_POS | I2C_CR1_ACK);
        } else {
                SET_BIT(i2c->CR1, I2C_CR1_ACK);
        }
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static ssize_t receive(I2C_dev_t *hdl, u8_t *dst, size_t count)
{
        ssize_t n = 0;

        I2C_t *i2c = get_I2C(hdl);

        if (count >= 3) {
                clear_send_address_event(hdl);

#if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
                if (I2C->periph[hdl->config->major].use_DMA) {
                        DMA_Channel_t *DMA = const_cast(DMA_Channel_t*, I2C_cfg[hdl->config->major].DMA_rx);

                        DMA->CPAR  = reinterpret_cast(u32_t, &i2c->DR);
                        DMA->CMAR  = reinterpret_cast(u32_t, dst);
                        DMA->CNDTR = count;
                        DMA->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_TEIE;

                        if (wait_for_DMA_event(hdl, DMA)) {
                                n = count;
                        }
                } else {
#else
                {
#endif
                        while (count) {
                                if (count == 3) {
//                                        if (!wait_for_I2C_event(hdl, I2C_SR1_RXNE)) // TEST
//                                                break;

                                        if (!wait_for_I2C_event(hdl, I2C_SR1_BTF))
                                                break;

                                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                        *dst++ = i2c->DR;
                                        n++;

                                        if (!wait_for_I2C_event(hdl, I2C_SR1_RXNE))
                                                break;

                                        stop(hdl);
                                        *dst++ = i2c->DR;
                                        n++;

                                        if (!wait_for_I2C_event(hdl, I2C_SR1_RXNE))
                                                break;

                                        *dst++ = i2c->DR;
                                        n++;

                                        count = 0;
                                } else {
                                        if (wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                                                *dst++ = i2c->DR;
                                                count--;
                                                n++;
                                        } else {
                                                break;
                                        }
                                }
                        }
                }

        } else if (count == 2) {
                _sys_critical_section_begin();
                clear_send_address_event(hdl);
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                _sys_critical_section_end();

                if (wait_for_I2C_event(hdl, I2C_SR1_BTF)) {
                        stop(hdl);

                        *dst++ = i2c->DR;
                        *dst++ = i2c->DR;
                        n     += 2;
                }

