devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        } else if (count == 1) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                clear_send_address_event(hdl);
                stop(hdl);

                if (wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                        *dst++ = i2c->DR;
                        n     += 1;
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static ssize_t transmit(I2C_dev_t *hdl, const u8_t *src, size_t count)
{
        ssize_t n    = 0;
        I2C_t  *i2c  = get_I2C(hdl);
        bool    succ = false;

        clear_send_address_event(hdl);

#if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
        if (count >= 3 && I2C->periph[hdl->config->major].use_DMA) {
                DMA_Channel_t *DMA = const_cast(DMA_Channel_t*, I2C_cfg[hdl->config->major].DMA_tx);

                DMA->CPAR  = reinterpret_cast(u32_t, &i2c->DR);
                DMA->CMAR  = reinterpret_cast(u32_t, src);
                DMA->CNDTR = count;
                DMA->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_TEIE | DMA_CCR1_DIR;

                if (wait_for_DMA_event(hdl, DMA)) {
                        n    = count;
                        succ = true;
                }
        } else {
#else
        {
#endif
                succ = true;
                while (count) {
                        if (wait_for_I2C_event(hdl, I2C_SR1_TXE)) {
                                i2c->DR = *src++;
                        } else {
                                succ = false;
                                break;
                        }

                        n++;
                        count--;
                }
        }

        if (n && succ) {
                if (!wait_for_I2C_event(hdl, I2C_SR1_BTF))
                        return n - 1;
        }

        stop(hdl);

        return n;
}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_EV_handler(u8_t major)
{
        GPIO_SET_PIN(PB15); // TEST

        if (I2C1->SR1 & I2C->periph[major].SR1_mask) {
                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
                CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                I2C->periph[major].unexp_event_cnt = 0;
        } else {
                /*
                 * This counter is used to check if there is no death loop of
                 * not handled IRQ. If counter reach specified value then
                 * the error flag is set.
                 */
                if (++I2C->periph[major].unexp_event_cnt >= 10) {
                        I2C->periph[major].error = EIO;
                        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
                        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                }
        }

        _sys_task_yield_from_ISR();

        GPIO_CLEAR_PIN(PB15); // TEST
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_ER_handler(u8_t major)
{
        GPIO_SET_PIN(PB15); // TEST

        I2C_t *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        if (i2c->SR1 & I2C_SR1_ARLO) {
                I2C->periph[major].error = EAGAIN;

        } else if (i2c->SR1 & I2C_SR1_AF) {
                GPIO_SET_PIN(PB14); // TEST
                if (I2C->periph[major].SR1_mask & (I2C_SR1_ADDR | I2C_SR1_ADD10))
                        I2C->periph[major].error = ENXIO;
                else
                        I2C->periph[major].error = EIO;
                GPIO_CLEAR_PIN(PB14); // TEST
        } else {
                I2C->periph[major].error = EIO;
        }

        // clear error flags
        i2c->SR1 = 0;

        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
        _sys_task_yield_from_ISR();

        GPIO_CLEAR_PIN(PB15); // TEST
}

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
#if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
static void IRQ_DMA_handler(const int DMA_ch_no, u8_t major)
{
        GPIO_SET_PIN(PB15); // TEST

        if (DMA1->ISR & (DMA_ISR_TEIF1 << (4 * (DMA_ch_no - 1)))) {
                I2C->periph[major].error = EIO;
        }

        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
        clear_DMA_IRQ_flags(major);
        _sys_task_yield_from_ISR();
        GPIO_CLEAR_PIN(PB15); // TEST
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel6_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_cfg[_I2C1].DMA_tx_number, _I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel7_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_cfg[_I2C1].DMA_rx_number, _I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_cfg[_I2C2].DMA_tx_number, _I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel5_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_cfg[_I2C2].DMA_rx_number, _I2C2);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
